app/controllers/reservations_controller.rb

SELECT `reservations`.* FROM `reservations`
---
  def index
    @reservations = Reservation.all

SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 1 LIMIT 1
---
  def show
    @reservation = Reservation.find(params[:id])

SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 6 LIMIT 1
---
  def edit
    @reservation = Reservation.find(params[:id])

INSERT INTO `reservations` (`created_at`, `name`, `num_guests`, `start_time`, `table_reserved`, `updated_at`) VALUES ('2012-09-01 20:41:46', 'Geeta', 3, '2012-09-01 19:57:00', NULL, '2012-09-01 20:41:46')
---
  def create
    @reservation = Reservation.new(params[:reservation])

    respond_to do |format|
      if @reservation.save

SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 6 LIMIT 1
---
  def update
    @reservation = Reservation.find(params[:id])

SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 1 LIMIT 1
DELETE FROM `reservations` WHERE `reservations`.`id` = 1
---
  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy